{"Concepts/Censorship":{"title":"Censorship","links":[],"tags":[],"content":"Censorship\nCensorship is the suppression or control of speech, communication, or information by a governing body or authority, often resulting in a lack of free expression and limited user autonomy.\nImagine you’ve been using a social platform to share your thoughts and connect with others. One day, you notice that your posts are disappearing or are no longer visible to your friends. Your reach is being reduced, and your voice is being silenced. This is an example of censorship at play—when someone else decides what you can and cannot say online, and what others can and cannot see.\nWhy Censorship is Inevitable\nCensorship is inevitable in today’s web because many popular services, like social platforms, require centralized hosting. These platforms need servers to store data, deliver content, and provide other services. As long as centralized servers are involved, someone—be it the server owner, government authority, or a corporate entity—can decide what content is allowed and what is not.\nThe reality is that many centralized platforms serve millions of users, which makes them natural targets for censorship. Server operators can be pressured to comply with local laws or corporate policies, meaning that user content can be restricted, removed, or filtered at any time.\nHowever, this doesn’t mean we should accept censorship without a solution. Instead, we need systems that assume censorship is likely and empower users to navigate around it.\nHow Pubky Addresses Censorship\nIn Pubky, the approach is not to eliminate censorship entirely—because some level of censorship will always exist where there are centralized components—but rather to provide users with a way to circumvent it when it happens.\n\n\nFlexible Hosting: Pubky provides a flexible hosting model using trusted servers known as Homeservers. While these servers may be subject to censorship, Pubky ensures that users have the ability to migrate away from a censoring server whenever needed. Users can move their data, identities, and connections seamlessly, meaning they retain control even in the face of censorship.\n\n\nDecentralized Identity: In Pubky, user identities are not dependent on any single server. By using self-issued public keys, users maintain their identity even if they change hosting providers. This prevents identity loss when moving away from a server that engages in censorship.\n\n\nData Portability and Redundancy: Pubky ensures that user data can be exported and re-imported across servers without any loss. Users can also use multiple servers for redundancy, minimizing the risk of any single point of failure or censorship cutting them off from their data.\n\n\nImportant Aspects of Censorship Resistance\n\nData Control: Users should always have access to and control over their data, even if one hosting provider chooses to censor it. Pubky’s approach empowers users by ensuring they are not dependent on any one server.\nMigration and Interoperability: The ability to migrate data, identities, and connections between different homeservers helps users remain resilient against censorship. Interoperable systems mean that even if one provider blocks content, another can provide access.\nLocal Copies and Self-Hosting: Users can keep local copies of their data, and Pubky encourages self-hosting, giving users more control over what happens to their information and ensuring their content is not subjected to centralized oversight.\n\nChallenges and Considerations\n\nLegal Compliance: Censorship is often tied to legal requirements that hosting providers must comply with. Even decentralized systems will face challenges related to legal jurisdictions, and Pubky is designed to navigate but not entirely eliminate these legal issues.\nContent Moderation: Some forms of moderation are necessary—whether it’s to filter out spam or harmful content. Pubky facilitates user-controlled moderation, where individuals or groups decide what they want to see, rather than a centralized authority imposing a one-size-fits-all policy.\nRedundancy Limitations: While Pubky’s redundancy and migration features provide resilience, they depend on the presence of multiple homeserver options. During the early phases, users may face limited availability of alternative servers.\n\nCensorship on the web is inevitable, but that doesn’t mean users have to be powerless. With Pubky, you have the ability to choose your hosting, migrate your data, and maintain your identity—all key tools for resisting censorship. Pubky’s design assumes censorship will happen and provides the mechanisms needed to overcome it. This empowers users with true control, ensuring that no single entity can unilaterally suppress their voice. The future of the web lies in resilient, user-first systems that put individuals back in control of their online presence."},"Concepts/Credible-Exit":{"title":"Credible Exit","links":[],"tags":[],"content":"Credible Exit\nCredible Exit is the ability to leave a platform or service without losing access to your data, identity, or connections, ensuring full user control and portability.\nThis substack post by Gordon Brander is a good introduction to the topic.\nImagine you’ve built a social profile on a platform. Over time, you start noticing that some of your posts are being restricted or your content is no longer being promoted. You don’t want to lose everything you’ve built—your posts, connections, or even your online identity. This is where Credible Exit comes into play. It ensures that you can leave a platform without losing what’s yours, giving you true control over your online presence.\nIt is also important for the credible exit to be feasible, as in a measure of cost, meaning the cost of exit should be within the order of magnitude of making an exit economically efficient.\nWhy Credible Exit is Important\nToday, most platforms hold your data hostage. They make it difficult to leave, and if you do leave, you often lose all your posts, connections, and your ability to stay visible. This is the result of centralized control—a few big platforms deciding what can be shared and who gets to see it. They can censor you or limit your access without warning.\nHere are some of the best examples of Credible Exit in practice:\n\nDomain Name System (DNS): DNS is a classic example of a system that allows for a credible exit. If you no longer want your domain hosted with one provider, you can transfer it to another without losing control over your domain name.\nEmail Protocols (IMAP/SMTP): Email is another example. Users can change email providers while keeping the same email address, ensuring they don’t lose their communication history or contacts.\nBitcoin Wallets: Bitcoin wallets offer credible exit by allowing users to export private keys and import them into another wallet provider, retaining full control over their funds and transactions.\n\nCredible Exit is a fundamental principle that ensures users are never locked in. It means having the freedom to move your data, identity, and content to a new service without losing anything. It gives you leverage, making sure that platforms compete for your trust rather than taking it for granted.\nHow Pubky Makes Credible Exit Possible\nIn Pubky, Credible Exit is not just an idea—it’s built into the architecture. Pubky combines decentralized routing and identity with flexible, user-controlled hosting to make sure you’re always in charge.\n\n\nTrusted Servers with a Safety Net: When you join Pubky, you can use a trusted server to host your data. These servers are there to provide convenience, but you’re never stuck. If the server changes its policies or you simply want to move, Pubky allows you to seamlessly migrate your data to another server without any loss of content or followers.\n\n\nDecentralized Identity: With Pubky, your identity is not tied to any one server. You use self-issued public keys that are recognized across the network. This means you can change where your data is hosted without losing your identity or connections.\n\n\nData Portability: Pubky’s design ensures that all of your data can be easily exported and imported between servers. This keeps your content intact and visible, regardless of where it’s hosted.\n\n\n(NOTE: During Pubky’s initial bootstrapping phase, credible exit may not be practically possible until more homeserver providers join. Synonym is building tools to make it easy for businesses and users to self-host.)\nImportant Aspects of Credible Exit\n\nProtocols: The foundation of credible exit, enabling communication and data transfer between systems.\nData Importance: Differentiating between basic data (content created by users) and generated data (interactions, likes, comments), which may require different approaches for exit.\nDimensions of Credible Exit: Including the ability to export data, sync data across platforms, use data in useful formats, and store data in local files.\n\nChallenges and Considerations\n\nStatic Exports: While GDPR regulations allow for data exports, the static nature of these exports can limit their utility for ongoing use.\nData Formats: The importance of using common, useful formats for data to ensure it can be utilized elsewhere.\nInteroperability: The potential for multiple apps to share data through permissionless APIs, enhancing broad interoperability.\n\nSummary\nCredible Exit is about freedom and control. It ensures that you’re never at the mercy of a single platform or server. With Pubky, you get the convenience of using trusted servers while always having an exit strategy—one that guarantees you keep everything you’ve built online. This is the foundation of a more open, user-first web, where platforms must earn your trust rather than exploit it."},"Concepts/Semantic-Social-Graph":{"title":"Semantic Social Graph","links":[],"tags":[],"content":"Semantic Social Graph\nA Semantic Social Graph represents relationships between users, content, and interactions, enriched with contextual meaning that enables better filtering, discovery, and coordination.\nImagine being able to not only see what your friends are sharing but also easily find content that matches your interests across a wide network of people you trust.\nInstead of relying on a centralized platform’s algorithm to decide what is relevant to you, the Semantic Social Graph lets you decide based on your relationships and the tags you assign to things. This is what Pubky envisions—a new way to structure social interaction on the web that empowers users with more control over their connections and content.\nWhy Semantic Social Graphs are Important\nMost traditional social media platforms use proprietary algorithms to determine which content to show users. These algorithms prioritize engagement, often at the cost of user autonomy and quality content. Users are left with minimal control over what they see, and these algorithms can create echo chambers or amplify misinformation.\nWith a Semantic Social Graph, the users are in control, shaping the web together. It allows them to enrich the relationships and content they interact with by adding contextual tags, trust levels, and preferences. This means users can decide which content they want to prioritize, who they trust, and how they want to discover new information. The graph is rendered as a unique perspective organically by each user, not dictated by a centralized entity.\nKey examples of how Semantic Social Graphs can be used include:\n\nFiltering: Users can create their own filters to see only content they deem valuable. For example, only seeing posts that have been tagged by certain friends or connections.\nDiscovery: Instead of relying on centralized algorithms, users can discover new content based on their own semantic tags and the relationships within their network. This gives users the ability to discover information that is more genuinely relevant to them.\nCoordination: A Semantic Social Graph also makes it easier for people to coordinate, as it allows users to form groups or match connections based on shared interests or values.\n\nHow Pubky Implements a Decentralized Semantic Social Graph\nIn Pubky, a decentralized Semantic Social Graph is central to providing a more open and user-first social experience.\nThis diagram shows how a Semantic Social Graph works, representing users, content, and tags. Users tag content and peers, which adds context and helps determine how information flows through the network. Relationships are weighted (Pubky weighting features are under development), meaning users can specify trust levels and the strength of connections to further personalize their experience.\ngraph LR\n    subgraph Users\n        U1[User A]\n        U2[User B]\n        U3[User C]\n    end\n\n    subgraph Data\n        C1[Post 1]\n        C2[Post 2]\n        C3[File 1]\n    end\n\n    subgraph Tags\n        T1[Tag: Blockchain]\n        T2[Tag: Decentralization]\n        T3[Tag: Privacy]\n    end\n\n     Users tag peers\n    U1 --|tags with T2|--&gt; U2\n    U2 --|tags with T1|--&gt; U3\n\n     Weighted relationships (represented by edge labels)\n    U1 --|strong connection|--&gt; U2\n    U1 --|moderate connection|--&gt; U3\n\nTags and Contextual Meaning: Pubky allows users to add tags to content and connections, giving them the ability to add context to their relationships. This means users can easily categorize and prioritize content based on what matters to them most.\n\n\nWeb of Trust: The concept of Web of Trust is foundational to the Semantic Social Graph. Users can assign contextual trust to their connections, allowing for a more nuanced approach to content discovery and filtering. Instead of seeing content from strangers or questionable sources, users can prioritize info from people they trust.\n\n\nDecentralized Indexing: Pubky provides a decentralized approach to indexing, meaning that users aren’t reliant on a single entity to determine the importance or visibility of content. Users have the power to decide what they want to see and how they want their views into the social graph to evolve.\n\n\n(NOTE: During the initial bootstrapping phase of Pubky, the Semantic Social Graph may be limited in decentralization until more builders adopt the system. Synonym is actively developing tools to make it easier to run a Pubky homeserver, or self-host.)\nWeb of Trust\nWeb of Trust is a decentralized trust model used in cryptography, particularly in systems like PGP, GnuPG, and other OpenPGP compatible systems, to establish the authenticity of the binding between a public key and its owner, traditionally used to verify identities or build trust without central authorities.\nThe Web of Trust (WoT) concept was first introduced by PGP creator Phil Zimmermann in 1992. This model is an alternative to the centralized trust model of a Public Key Infrastructure (PKI), which relies on a certificate authority (CA) or a hierarchy of such authorities.\nWeb of Trust always seemed like a promising way to build decentralized trust networks, but it has limitations that have become more apparent over time. The idea of users assigning trust levels to others in their network is still useful, but trust is not a binary decision—it’s nuanced, contextual, and ever-changing. While Web of Trust provides a good foundation, it lacks the flexibility required for more complex social environments.\nTrust is not just about whether you trust someone or not; it’s about how you trust them, in what context, and to what extent. This is why the Semantic Social Graph expands on the primitive idea of a Web of Trust. Instead of treating trust as a simple yes/no relationship, the Semantic Social Graph allows users to add context, weight, and tags to their connections, making it far more adaptable to real-world social dynamics.\nFor example, you may trust one person for their expertise in technology but not for financial advice. The Semantic Social Graph allows you to capture these nuances by adding contextual meaning and defining the type of trust you place in different connections. This makes it a more effective and precise tool for socializing reputation and controlling the flow of information.\nWeb of Trust still plays a role in Pubky by helping users assign inherent trust to connections, but it is part of a broader subjective system. With Semantic Social Graphs, Pubky enhances the ability of users to manage their networks with greater precision and personal relevance.\nChallenges and Considerations\n\nAdoption: The effectiveness of a Semantic Social Graph depends on widespread adoption. If only a few users add context to their relationships and content, the graph’s utility will be limited. However, as more users participate, the graph becomes increasingly valuable.\nPrivacy: Adding context to relationships can raise privacy concerns. Users need to be mindful of how much information they share and with whom. Pubky provides some privacy tools, but users must still be careful about the data they make public, and their public behavior.\nComplexity: Creating and maintaining a Semantic Social Graph requires interaction from users. Tagging content, assigning trust levels, and managing relationships must be implemented in useful, intrinsic ways. Pubky aims to simplify this process as much as possible through intuitive user interfaces and tools.\n\nSummary\nThe Semantic Social Graph is about putting users back in control of their social interactions online. Instead of relying on opaque, centralized algorithms, Pubky enables users to build their own networks based on trust, context, and shared interests. By giving users the ability to tag content, assign trust levels, and manage their relationships, Pubky aims to create a more meaningful and personalized social experience. The Web of Trust further enhances this by allowing users to curate their content and connections based on their own criteria, leading to a healthier, more user-driven social ecosystem."},"Concepts/Semantic-Social-Graphs":{"title":"Semantic Social Graphs","links":[],"tags":[],"content":"What Is a Decentralized Semantic Social Graph?\nwww.mermaidchart.com/raw/04ba45a5-6559-45fd-861c-f5d3ac878a91\nSemantic Relationships: Connections between users and content are tagged with meaningful metadata, capturing the context, relevance, and nature of each relationship.\nWeighted Connections: Relationships aren’t just binary; they carry weights that represent their strength, trust level, or relevance, enabling more sophisticated interactions.\nUser-Centric Personalization: Users have control over how they interact with the network, allowing them to tailor their experience based on their interests and connections.\nDecentralization: There’s no central authority controlling the network. Users own their identities and data, promoting privacy and sovereignty.\nWhy It Matters\nEnhanced Content Curation: By understanding the semantic meaning and weights of relationships, users receive content that’s more relevant and engaging.\nScalability: Automated tagging and weighting mechanisms scale effortlessly, accommodating growing networks without compromising performance.\nRich Interactions: Users can engage in more meaningful ways, as the network understands the context and nuances of each relationship.\nSemantic Graphs in Pubky App\nThe Pubky App is a user-friendly platform that showcases the capabilities of Pubky Core and PKARR.\nSocial Tagging: Users can tag posts, files, links, and even peers with meaningful labels. This enriches the semantic content of the network.\nCustomizable Feeds: By utilizing tags and weighted relationships, users control what appears in their feeds, ensuring content relevance.\nPeer Tagging: Assign semantic tags to peers, influencing how their content is weighted and displayed.\nWeb of Relevance: Move beyond the traditional Web-of-Trust paradigm to a network where relevance and context drive interactions.\nHow Pubky Applies Decentralized Networking and Social Graphing\nPubky combines decentralized identity, semantic social tagging, and weighted relationships into a cohesive system that offers unparalleled user control and personalization.\nSemantic Social Graphing\nWeighted Distances: Relationships aren’t just connections; they have weights that represent their strength or relevance to the user.\nAdvanced Content Curation\nPersonalized Feeds: Users define what content matters to them, and the network delivers it based on semantic relevance and weighted relationships.\nDynamic Filtering: Adjust your view of the network in real-time by modifying tags and weights, ensuring your feed evolves with your interests.\nWhy It’s Different\nPubky bridges the gap between decentralized identity management and personalized content curation, something traditional models haven’t achieved.\nEnhancing Privacy and Security: By eliminating centralized points of control, Pubky reduces vulnerabilities and enhances user privacy.\nPromoting Open Innovation: As an open-source project, Pubky invites developers and enthusiasts to contribute, fostering a community-driven evolution of the platform."},"Pubky-App/App-Architectures/1.-Introduction":{"title":"1. Introduction","links":["Pubky-Core/Introduction","Data-Stores","Pubky-App/App-Architectures/2.-Client---Homeserver","Pubky-App/App-Architectures/4.-Custom-Backend","Pubky-App/App-Architectures/3.-Global-Aggregators"],"tags":[],"content":"Leveraging the Pubky Core protocol as the foundational layer, we can envision a diverse array of applications with distinct functionalities. While each app can implement its own unique design patterns and user interfaces, they all share a common underlying architecture: interacting with the distributed data stores, colloquially referred to as home servers, through standardized read and write operations.\nThe Pubky Core protocol enables a decentralized approach to data management, facilitating seamless communication between clients and their respective data stores. This architecture promotes data sovereignty and enhances system resilience.\nBelow, we present several high-level designs that showcase the versatility of this architecture, from simple client (browser) apps that interact directly with one or several homeservers to more complex applications with custom aggregators and backends capable of powerful inference:\n\nClient-Homeserver\nCustom backend\nGlobal aggregators\n"},"Pubky-App/App-Architectures/2.-Client---Homeserver":{"title":"2. Client - Homeserver","links":[],"tags":[],"content":"\nIn this architecture, we implement a direct communication model between the client application and the home server. This approach minimizes latency and reduces system complexity by establishing a direct data flow pathway.\nThis design pattern is particularly well-suited for applications with straightforward functionality, especially those that don’t require real-time interaction or data normalization. This architectural approach demonstrates optimal performance in use cases characterized by intermittent data operations, where asynchronous read/write cycles are adequate for maintaining data consistency and fulfilling application requirements.\nTo illustrate the practical applications of this architectural paradigm, consider the following implementation scenarios:\n\nBookmark Management System: A client application designed to store and retrieve user bookmarks directly from the home server.\nFile Synchronization Utility: Similar to the open-source Syncthing project, this type of application would facilitate direct file synchronization between the client and the home server.\nText Snippet Repository: A lightweight application for creating, storing, and retrieving short text fragments or code snippets as pastebin\n\nThese implementations leverage the Pubky Core protocol to establish secure, efficient, and direct data exchange channels between the client and the home server, while the user remains with ownership of their data."},"Pubky-App/App-Architectures/3.-Global-Aggregators":{"title":"3. Global Aggregators","links":[],"tags":[],"content":"\nThis architectural pattern implements a distributed system model centered around a global aggregation layer, eliminating the need to fetch data from a multitude (maybe thousands!) of homesevers by the client. The core component of this design is a centralized global aggregator that interfaces with multiple home servers, consuming events from each in a unified manner.\nKey features of this architecture include:\n\nCentralized Event Processing: The global aggregator serves as a single point of convergence for event streams originating from disparate home servers across the network.\nPolicy-Driven Filtering: The aggregators can optionally implement a configurable set of policies and filtering rules, allowing for dynamic event processing based on predefined criteria.\nClient Flexibility and Aggregator Choice: Clients consume data from the global aggregator stream. However, if a client finds the enforced rules of one aggregator unsuitable, it retains the flexibility to switch to an alternative global aggregator that better aligns with its requirements or selectively look for the homeservers itself.\nScalable Event Distribution: By centralizing the aggregation process, this architecture facilitates efficient event distribution to multiple clients, potentially reducing redundant processing and network overhead.\n"},"Pubky-App/App-Architectures/4.-Custom-Backend":{"title":"4. Custom Backend","links":["Pubky-App/Introduction"],"tags":[],"content":"\nThis architectural design introduces a more sophisticated data flow model, incorporating an intermediary backend layer between the client application and the home server. This backend functions as a middleware, enhancing the system’s flexibility and data processing capabilities.\nThe backend can be potentially comprised with many components. These components will depend on the client app needs, but these are the main ones\n\nIndexer: Responsible for data normalization, ensuring consistent data structures and optimizing query performance.\nAggregator: Implements event filtering logic, allowing for selective data propagation based on predefined criteria.\n\nThis architecture supports two distinct data consumption patterns:\na) For scenarios requiring both data normalization and event filtering, the client interacts with the backend layer, as an endpoint. The aggregator processes the event stream from the home servers, applying filtering rules before passing the data to the indexer for normalization.\nb) In cases where only data normalization is necessary, the backend can bypass or not implement the aggregator, consuming events directly from the home server via the indexer.\nThis modular approach allows for fine-grained control over data processing, enabling efficient resource utilization and optimized client-side performance based on specific application requirements.\nAn example of a complex backend that does aggregation, normalization, indexation, filtering (compliance) and powerful inference is Pubky-Nexus, the backend that powers the Pubky App social features."},"Pubky-App/Backend/Aggregator":{"title":"Aggregator","links":["Data-Stores","2.Censorship"],"tags":[],"content":"Pubky Aggregators\nAggregators are specialized reducers or gatekeepers that continuously scan and collect data from various sources, such as data stores. They decide what data to allow in and what to keep out.\nWhen the aggregator receive new events, it evaluates it against its predefined criteria. If the data meets the criteria, the aggregator allows it to pass through, making it available for further processing or storage. However, if the data doesn’t meet the criteria, the aggregator blocks it, preventing it from entering the system.\nBy controlling the flow of information, aggregators play a crucial role in maintaining data quality, preventing information overload, and ensuring that only the most valuable and relevant data is used.\nCharacteristics\n\nFine-grained access controls: Users and aggregators have granular control over what data is shared, with whom, and under what conditions, ensuring selective and secure data exchange.\nEfficient data synchronization: Merkle trees enable fast and efficient synchronization of incremental changes from data stores, reducing the overhead of data aggregation.\nNormalized data schemas: Standardized data schemas facilitate interoperability between services, making it easier to integrate and exchange data across the network.\nPublic and niche aggregators: The network supports both large-scale, public aggregators for discoverability and smaller, niche aggregators that cater to specific communities or use cases.\nCore user graph expansion: The aggregation process starts with a core user graph and expands outward through connections, enabling the network to grow organically and efficiently.\nCensorship resistance: The system’s censorship resistance is achieved through a decentralized aggregation architecture, where data aggregation is distributed across a network of independent, autonomous aggregators. This design ensures that no single entity or node has control over the aggregation process, making it more resilient to censorship attempts.\n"},"Pubky-App/Backend/Indexer":{"title":"Indexer","links":["Data-Stores"],"tags":[],"content":"The Indexer is a specialized component that plays a crucial role in the system by normalizing and transforming the aggregated data from multiple data stores into a unified view. This enables cross-data store search, queries, and discovery, allowing users to access and analyze data from various sources in a seamless and efficient manner.\nCharacteristics\n\nData Normalization: The Indexer normalizes the data from multiple sources, handling differences in format, structure, and schema. This involves transforming the data into a consistent format, resolving data conflicts, and ensuring that the data is accurate and reliable.\nData Transformation: The Indexer transforms the normalized data into a unified view, making it possible to query and analyze the data across multiple data stores. This unified view enables users to access data from different sources as if it were a single, cohesive dataset.\nData Integrity: The Indexer ensures data integrity through secure synchronization protocols, guaranteeing that the indexed data is consistent and up-to-date. This involves implementing measures to prevent data corruption, ensuring that data updates are propagated across all data stores, and maintaining a high level of data quality and accuracy.\nScalability: The Indexer is designed to handle large volumes of data from multiple sources, ensuring that it can scale to meet the needs of a growing user base and increasing data demands.\n\nBy normalizing, transforming, and ensuring the integrity of the data, the Indexer provides a robust and scalable solution for cross-data store search, queries, and discovery"},"Pubky-App/Backend/Introduction":{"title":"Introduction","links":["Pubky-App/Backend/Aggregator","Pubky-App/Backend/Indexer","Data-Stores","Pubky-App/Backend/Web-Server","Pubky-App/Client/Introduction"],"tags":[],"content":"The Backend is responsible for collecting (aggregators) and organizing (indexer) data from various sources, known as data stores.\n\nImagine you’re trying to find a specific document in a large library. The backend is like a librarian who searches through the shelves, finds the right documents, and prepares them for you to use. This ensures that the data is accurate, up-to-date, and in a format that’s easy to work with.\nMain components\n\nAggregators execute a data retrieval protocol to obtain data from data storage, initiating a process that retrieves and collects data from various sources.\nIndexers receive aggregated data from the Aggregators and initiate a rigorous data normalization process, transforming and converting the data into a standardized format to ensure consistency and accuracy.\nWeb servers provide the requested data to Pubky client\n"},"Pubky-App/Backend/Web-Server":{"title":"Web Server","links":["Pubky-App/Client/Features/Tags","Pubky-App/Client/Features/Profiles","Technologies/Paykit"],"tags":[],"content":"The system comprises a suite of backend services that orchestrate the integration of data feeds, search functionality, and user interface configurations. The system provides a unified platform for data ingestion, processing, and presentation, enabling seamless interactions between the frontend and backend components.\nServices\n\nFeeds - Curated views of aggregated data presented to users. Can include timelines, tags, profiles, etc.\nSearch - Services that index aggregated data and enable full text/attribute searches.\nIdentity - It provides single sign-on through self-sovereign credentials.\nPayments - It handles microtransactions like tipping within a peer-to-peer economy.\n\nArchitecture\nThe web server can be designed and implemented using various architectural patterns, depending on the specific requirements of the data request workflow. Two prominent architectural styles that can be employed are:\n\nMonolithic Architecture: A single-tiered architecture where the web server is constructed as a self-contained unit, encompassing all necessary components and functionality. This approach is characterized by a tightly-coupled design, where all components are integrated into a single executable or deployable unit.\nMicroservices Architecture: A multi-tiered architecture where the web server is decomposed into a collection of loosely-coupled, independent services that communicate with each other using APIs and messaging protocols. Each microservice is responsible for a specific business capability or data domain, enabling greater flexibility, scalability, and resilience.\n\nThe choice of architecture depends on various factors, including data request patterns, traffic volume, performance requirements, development team expertise, and maintenance considerations."},"Pubky-App/Client/Features/Bookmarks":{"title":"Bookmarks","links":[],"tags":[],"content":"Bookmarks\nBookmarks are a feature that allows you to privately save post for later reference. Here are some ways you can use bookmarks:\n\nSave for later reading: If you come across a post that you don’t have time to read or engage with immediately, you can bookmark it to read later when you have more time.\nReference material: Bookmarks can serve as a repository for tweets that contain useful information, such as articles, tutorials, or resources, that you might need to refer to later. In that case, you can organise the posts by topic.\nPrivate note-taking: Bookmarks can serve as a private note-taking system, allowing you to save tweets that you want to remember without having to publicly like or retweet them.\n\nTo bookmark a post, simply click or tap the “Bookmark” icon (it looks like a ribbon) on the post. You can access your bookmarked posts by clicking the button on top of the page."},"Pubky-App/Client/Features/Layouts":{"title":"Layouts","links":[],"tags":[],"content":"Layouts\nPubky client offers multiple customizable UI layouts for users that prefer different column, grid, and list layouts for their feeds."},"Pubky-App/Client/Features/Notifications":{"title":"Notifications","links":["Pubky-App/Client/Features/Posts"],"tags":[],"content":"Notifications\nPubky client tracks various event or activities the user may be interested in, and provides relevant notifications for interactions and other relevant activity to the user. Notifications are a way to keep you informed about what’s happening in the app, even when you’re not actively browsing your timeline.\nHere are some common types of notifications you might receive:\n\nMentions: When someone mentions you in a post, you’ll receive a notification. This means they’ve included your public key (pk:pubky) in their post.\nReplies: If someone replies to one of your post, you’ll get a notification.\nLikes: When someone likes one of your posts, you’ll receive a notification.\nRe-posts: If someone re-posts one of your posts, you’ll get a notification.\nFollows: When someone new follows you, you’ll receive a notification.\nQuote Posts: If someone quotes one of your posts, you’ll receive a notification.\n"},"Pubky-App/Client/Features/Perspectives":{"title":"Perspectives","links":[],"tags":[],"content":"Perspectives\nUsers can save any custom-filtered view or feed as a “perspective” which is basically a custom template of settings of tags, weights, users, reach, and trends. Perspectives can also save custom UI layouts for the user."},"Pubky-App/Client/Features/Posts":{"title":"Posts","links":["Pubky-App/Client/Features/Tags"],"tags":[],"content":"Posts\nIn Pubkey client, a post is a message that a user publishes on the platform. Posts are the core content and they can contain a variety of information, including:\n\nText: There is not text limitation of plain text, which can include words, phrases, sentences, or even just a single character.\nMedia: Post can include various types of media, such as images and videos.\nTags: It is a keyword or phrase preceded by the ”#” symbol, which help categorize and make post discoverable by topic.\nMentions: References to other Pubky users, denoted by the “pk” keyword which notify them of the post.\nLinks: URLs to external websites, articles, or other online content.\nEmojis: Small images or icons used to convey emotions or add tone to the tweet.\n\nUsers also can re-post and reply to posts"},"Pubky-App/Client/Features/Profiles":{"title":"Profiles","links":[],"tags":[],"content":"Profiles\nIn Pubky client, a profile refers to a user’s personal page on the app, which displays their information, posts, and other content. A Pubky profile is a unique identity that represents a public-key.\nHere are some key components of a Pubky profile:\n\nUsername: A unique handle or identifier that represents the user, often preceded by the “pk” keyword(e.g. pk:uudfeafc1c6dhxxnaiyuzss5ln9i1ikpb8syht46qpnx4ksi6ho).\nProfile picture: A small image that represents the user, often a photo or logo.\nBio: A short description of the user, often including information about their interests, profession, or personality.\nWebsite: A link to the user’s personal website, blog, or other online presence.\nPosts: The user’s posts, which are displayed in reverse chronological order (newest tweets first).\nFollowers: The number of users who follow the profile, indicating the size of their audience.\nFollowing: The number of users that the profile follows, indicating the accounts they’re interested in.\nLists: The number of lists the user has created or been added to, which are curated groups of accounts.\n"},"Pubky-App/Client/Features/Search":{"title":"Search","links":[],"tags":[],"content":"Search\nWhile Tags &amp; Filters are the primary sorting tools, the app also provides limited traditional search capabilities."},"Pubky-App/Client/Features/Tags":{"title":"Tags","links":["tags/Pubky","tags/privacy","tags/segwit"],"tags":["Pubky","privacy","segwit"],"content":"Tags\nThey are keywords or phrases that are added to a tweet to help users find and engage with the content. Users can publicly assign contextual tags, like hashtags, to any other user or post. Tags can be used to filter posts and users. Users can also choose custom weighting of tags when filtering.\nHow do tags work?\n\nHashtags: Tags are denoted by the ”#” symbol, followed by a word or phrase. For example,Pubky,privacy, orsegwit.\nClickability: When you click on a tag, Pubky client takes you to a page that displays all the posts that have used that same tag.\nDiscovery: Tags help users discover new content, accounts, and conversations related to a specific topic.\nCategorization: Tags help categorize posts, making it easier for users to find and engage with content that interests them.\n"},"Pubky-App/Client/Features/Trends":{"title":"Trends","links":[],"tags":[],"content":"Trends\nPubky client can provide statistical views of the data it has access to and then establish visualizations and leaderboard lists of trending posts, tags, and users."},"Pubky-App/Client/Introduction":{"title":"Introduction","links":["Pubky-App/Backend/Introduction","3.Credible-Exit","Pubky-Core/Introduction","Technologies/Paykit"],"tags":[],"content":"Pubky Client\n\nThe Pubky client will be available as both a desktop application and a hosted website service (standard website) that allows users to interface with the social media layer of Pubky Backend using Synonym hosted services.\nUsing the library analogy again, the Pubky Client is like a personalized research assistant who takes the prepared documents from the librarian (backend) and creates a customized report just for you. This report is designed to be easy to read and understand, with all the relevant information presented in a clear and concise manner.\n\n\nUsers are able to take control of the data and exit the Synonym hosted services and run their own without hampering discoverability (credible exit).\n\n\nPubky client uses the open Pubky Core for nearly all features, allowing users to avoid censorship by choosing self-hosting or alternate hosts without losing followers or integrity. \n\n\nPubky also features support for paykit, our open payment protocol for coordinating payments among peers supporting various methods. This allows users to create sub-accounts from master wallets for familiar payment experiences. This suite of features removes any requirement from Synonym to custody user funds, while allowing for users to set up subscriptions, recurring payments, paywalls, etc, in a P2P way. This feature will not be in the first launch version of Pubky app, but it is worth noting that next year we will enable all users to buy and sell data in this way.\n\n\nCommunities facilitate moderation and discovery around shared interests.\n\n"},"Pubky-App/ELI5":{"title":"ELI5","links":[],"tags":[],"content":"ELI5: Pubky App\nImagine you’re at a massive party where everyone is sharing stories, showing pictures, and having interesting conversations. You get to decide who you talk to and what stories you listen to. You have full control over how you interact with people—choosing who to trust and which conversations to join. This is what Pubky App is like for the internet—it gives you the power to choose who you connect with and what you share, just like you would at a party, without anyone else deciding for you.\nPubky App is like having your own personal party host that you can fully control. Instead of letting big companies decide who sees your posts or what shows up in your feed, Pubky App gives you the power. It lets you decide which content you see, who you interact with, and how you organize your online world.\n\n\nYour Rules, Your Control: Pubky App lets you control your connections with simple rules. If you only want to hear from your closest friends or people who share your hobbies, you can easily decide that. There are no hidden algorithms deciding what you should pay attention to—you are the one in charge.\n\n\nTags and Trust: With Pubky, you can tag people, posts, and content based on how much you trust them or how relevant they are to you. This means you can filter out the noise and focus on the people and content that really matter.\n\n\nMove Anytime: Imagine if you wanted to leave the party and join a different one, but still keep all your friends and stories with you. Pubky App lets you do that too. You can switch to a new service or hosting provider whenever you want, without losing your posts, friends, or identity. You’re never locked in.\n\n\nSo, with Pubky App, you’re in charge of your online world—deciding who you talk to, what you see, and how you share. It’s about making the internet feel more like a real conversation with the people you care about, instead of letting algorithms decide for you."},"Pubky-App/Introduction":{"title":"Introduction","links":["Data-Stores","Pubky-App/Introduction","Pubky-App/Backend/Aggregator","Pubky-App/Client/Features/Search","Pubky-App/Backend/Introduction","Pubky-App/Client/Introduction","Pubky-Core/Introduction","Pubky-Core/Pkarr/0.Introduction"],"tags":[],"content":"\n\nSynonym will be initially hosting: Data stores and Pubky App\n\nOverview\nPubky-app’s initial focus is building a decentralized social media protocol.\nKey aspects\n\nData Ownership: Users have full autonomy over their data, hosting it on independent data stores that are decentralized and distributed across the network. This approach enables users to maintain control and ownership of their data, while also ensuring data sovereignty and privacy.\nProfiles: The system employs a decentralized data storage approach, where post, comment, and like data are stored in association with user profiles.\nAggregators collecting social graphs\nFeeds of followings’ activities\nSearching profiles and posts\nNotification delivery through aplication backends\nDistributed moderation through user blocking\n\nComponents\nThe Pubky App is a complex system that can be broken down into two main components: the backend and the client. These two pieces work together to provide a seamless user experience.\nBackend: The Data Organizer\nIt collects and organizes data from various sources, processing it into a usable format.\nClient: The User Interface\nIt is the part of the Pubky App that you interact with directly. It’s responsible for taking the organized data from the Backend and presenting it to you in a visually appealing and easy-to-understand way.\nMVP Architecture\nThe early versions of Pubky app take some shortcuts over the Pubky Core design. The MVP app is centralized, therefore we saved time and complexity by aggregating functionality into fewer components. The main two components are the Homeserver and the Indexer\n\nThe Homeserver fulfils the function of data stores, Pkarr republishing for users, identity-provider (Oauth-like sign-in). Users maintain a trust relationship with the Homeserver.\nThe Indexer fulfils the function of the backend for the Pubky App.\n"},"Pubky-Core/ELI5":{"title":"ELI5","links":[],"tags":[],"content":"Explaining Pubky Core Like You’re 5 Years Old\nImagine you have a special toy castle that you built, and you want your friends to come and play with it. Maybe you set up your castle in your backyard, or in the park, or at your grandma’s house. You tell your friends where it is so they can come play.\nNow, suppose you chose the park, but it is closed, or someone says you can’t keep your castle there anymore. No worries!\nYou Move the Castle: You pick up your castle and set it up somewhere else, like your backyard.\nYou Tell Your Friends: You let your friends know the new spot so they can still come and play.\nSo, what is Pubky Core?\n**Pubky Core is like you being in charge of where your stuff lives on the internet. Even if things change—like someone tries to block your stuff or you decide to move it—you have the power to:\n**\nChoose Where Your Data Lives: Just like you decide where to place your castle, Pubky Core lets you decide where your information is stored online.\nMove It When Needed: If you have to change where your data is kept (like moving your castle), you can do that easily.\nUpdate the Directions: You can tell everyone where to find your data, so your friends can always access it, no matter where it is.\n**Why is Pubky Core Special?\n**\nYou’re in Control: You decide where your data is stored on the internet, and you can change it whenever you need to.\nStay Connected Despite Changes: If something happens—like censorship or a website blocking you—you can move your data to a new place, and people can still find it.\nFreedom to Share: No one can stop you from sharing your stuff. You always have the ability to let others access your data by updating its location.\n**In Simple Terms:\n**\nYou Control the Location of Your Data: Just like moving your castle, you choose where your online information lives.\nAdaptable to Change: If things change or someone tries to stop you, you can move your data and keep sharing without losing anything.\nAlways Accessible: By updating where your data is stored, your friends (or anyone) can always find and see it.\nSo, Pubky Core empowers you to manage where your data is on the internet. It ensures that even if things change—like being censored or needing to move—you can keep your data accessible and tell others where to find it. It’s all about you being in control, just like deciding where to set up your favorite toy so your friends can always come and play!"},"Pubky-Core/Homeservers":{"title":"Homeservers","links":[],"tags":[],"content":"The Pubky network allows multiple, independent data stores, known as “homeservers.” This improves censorship-resistance and prevents any single entity from controlling the flow of information, or locking people &amp; data in as a walled garden.\nHomeservers are meant to represent a primary place to retrieve data from a specific PKARR public key, but the user can redefine the location of their homeserver at will by updating their PKARR in Mainline DHT.\nPublic vs Private Data\nCurrent implementations across Pubky currently only support public, unencrypted data use cases. This does not prevent applications from using encrypted data within homeservers, we simply haven’t implemented that set of features in any direct way yet. Feel free to contribute!\nData Retrieval and Synchronization\n\nAPI and Pub/Sub access: Authorized services can access data through a RESTful API or via a publish-subscribe (Pub/Sub) messaging system, enabling efficient and scalable data retrieval.\n\nDecentralized Storage Architecture\n\nHomeservers can be operated by individuals, cooperatives, or commercial entities, with the option for anonymous operation, promoting a decentralized and resilient storage ecosystem where users could tune their preferred redundancy while maintaining the benefits of a central homeserver.\nWe do not yet have any mirroring or replication tools available yet. Feel free to build with us!\n\nUser Data Control and Credible Exit\n\nThe current network is being bootstrapped by Synonym’s first homeserver, which supports key accounts as a service, as well as all services required to operate the Pubky App.\nWhile Synonym is currently not charging fees for homeserving, it is totall possible for anyone to run their own homerserver and require service fees or peer-to-peer micropayments, or any other requirement, to improve data redundancy and competition.\nSynonym does not control who can join or serve data on the network, but in order to truly have a “credible exit” the network will need to mature to have more providers of homeservers and Pubky applications.\nWe will also need to make it as easy as possible for people to host their own homeservers, and to host homerserver clouds.\nWe also need to ensure that applications remain performant &amp; reliable as the network fragments.\n\nWIP\n\nMerkle tree-based versioning: Merkle trees to manage versioning and conflict resolution, ensuring efficient data synchronization and minimizing data inconsistencies.\n"},"Pubky-Core/Introduction":{"title":"Introduction","links":["Data-Stores","Pubky-Core/Pkarr/0.Introduction","3.Credible-Exit","Pubky-App/App-Architectures/1.-Introduction","Pubky-App/App-Architectures/2.-Client---Homeserver","Pubky-App/App-Architectures/4.-Custom-Backend","1.Web-of-Trust","Pubky-App/Introduction"],"tags":[],"content":"Pubky Core Overview\n\nPubky Core is built on a few core concepts:\n\n\nData Stores - Decentralized data storage nodes that host user data. Data is encrypted at rest.\n\n\nPkarr - Self-issued public keys that function as sovereign, publicly addressable domains are used to resolve the previous components.\n\n\nPubky Core’s distributed architecture aims to provide user autonomy through credible exit between interchangeable components.\n\nPubky App Architectures can be very diverse. From simple web client applications that connect to a single homeserver for data storage and retrieval to complex backends  that do aggregation and powerful inference over many homeservers creating abstractions such as social media with web of trust.\n\nTarget Users\nPubky Core is made for developers and builders of internet software products. We will actively work to cultivate a community of builders and startups using our tech.\nPubky App is made for anyone interested in social media and online publishing that wants new ways to control their data and more control over which posts they see.\nWhy? What is the reward?\nThe reward for everyone is a more open, privacy-focused, usable, modular and secure web. The reward for Synonym as lead of this project is to be positioned to disrupt Big Tech as an industry, gain user recognition and hopefully reputation through the effort of building a decentralized ecosystem. The ultimate potential is for Synonym to become a major player in online publishing &amp; social media, while also monetizing in ways similar to Google (e.g., search and aggregation over the web → search / aggregation and tools for sovereign data stores), as well as opportunities to introduce new users to our ecosystem of products and services (e.g., bitcoin payments infrastructure)"},"Pubky-Core/Pkarr/0.Introduction":{"title":"0.Introduction","links":["Technologies/DNS","Technologies/DHT","Technologies/Mainline-DHT","Technologies/HTTPS","Technologies/DoH","Pubky-Core/Pkarr/4.Architecture","Pubky-Core/Pkarr/2.Getting-Started-with-Pkarr"],"tags":[],"content":"Public-Key Addressable Resource Records\nPkarr is a revolutionary system that bridges the gap between the Domain Name System (DNS) and peer-to-peer overlay networks. It allows self-issued public keys to function as sovereign, publicly addressable domains. This means that anyone with a private key can have a domain that is accessible to everyone.\nThe core idea is to streamline the process of publishing and resolving resource records for keys, leveraging the Distributed Hash Table (DHT) for efficient and scalable data distribution.\nKey Features\n\nSimplicity: Pkarr streamlines the integration between DNS and peer-to-peer networks.\nSovereignty: Public keys can be used as domains, enabling users to maintain control over their digital identities.\nAccessibility: The system is designed to be accessible to anyone capable of maintaining a private key.\nScalability and Resilience: Designed with scalability and resilience in mind, using the Mainline DHT for storing ephemeral data, and employing caching strategies to minimize DHT traffic.\nCompatibility with Existing Applications: Supports existing applications through DNS over HTTPS (DoH) queries to Pkarr servers, ensuring broad compatibility.\n\nHow It Works\n\nPublishing Records: To publish resource records for a key, create a small encoded DNS packet (⇐ 1000 bytes), sign it, and publish it on the DHT. This can be done directly or through a relay if necessary.\nResolving Records: To find resources associated with a key, applications can query the DHT directly or through a relay, verifying the signature themselves.\nFallback for Existing Applications: Applications unaware of Pkarr can make normal DNS Queries over HTTPS (DoH) to Pkarr servers, ensuring accessibility.\nCaching and Republishing: Both clients and Pkarr servers cache records extensively to improve scalability. The DHT drops records after a few hours, necessitating periodic republishing to keep records alive.\n\nFor more technical details on Pkarr’s architecture and how it works, refer to the architecture note.\nGetting Started\nTo start using Pkarr, you can visit the web app demo or explore the Rust examples provided in Pkarr repository."},"Pubky-Core/Pkarr/1.Why-Pkarr":{"title":"1.Why Pkarr?","links":[],"tags":[],"content":"This note explores the motivation behind Pkarr, addressing the challenges of distributed semantics, databases, and discovery.\nIn pursuit of a sovereign, distributed, and open web, we identify three challenges:\n\n\nDistributed Semantics Everything expressed as keys and metadata\nDeveloping interoperable semantics for verifiable metadata about a set of public-keys that form a digital identity, complete with reputation, social graph, credentials, and more.\n\n\nDistributed Database(s) Anyone can host the data\nVerifiable data alone is insufficient; a host-agnostic database is essential for an open web, as opposed to walled gardens.\n\n\nDistributed Discovery Where is the data?\nBut before that, you need to efficiently and consistently discover the multiple hosts for a given data-set.\n\n\nAddressing Distributed Discovery first makes the most sense for several reasons:\n\n\nThe difficulty of these three challenges inversely correlates with their order.\n\n\nThe marginal utility of solving these challenges positively correlates with their order.\nIn existing and emerging open social network protocols, users do tolerate limited interoperability between clients, second-class identifiers controlled by hosting or domain servers, inefficient or non-existent conflict-free replication between data stores, and the absence of local-first or offline support. However, their most common complaints involve unavailability, censorship, deplatforming, and difficulty in securely managing keys.\n\n\nDistributed Discovery offers the greatest assured leverage by abstracting over current and emerging solutions for (1) and (2) as they compete, complement, and develop independently, all while maintaining the same long lasting identifier, so you don’t have to start from scratch or be locked in.\n\n"},"Pubky-Core/Pkarr/2.Getting-Started-with-Pkarr":{"title":"2.Getting Started with Pkarr","links":["Pubky-Core/Pkarr/0.Introduction","Technologies/DNS","Technologies/DHT","Technologies/HTTPS","Technologies/DoH","Pubky-Core/Pkarr/4.Architecture"],"tags":[],"content":"This guide will help you understand how to publish and resolve resource records using pkarr.\nPublishing Resource Records\nTo publish resource records for your key, you need to sign a small encoded DNS packet (⇐ 1000 bytes) and publish it on the DHT. This can be done through a relay if necessary.\nResolving Resource Records\nTo resolve some key’s resources, applications can query the DHT directly or through a relay. They will then verify the signature themselves.\nDNS Queries Over HTTPS\nExisting applications unaware of pkarr can make normal DNS Queries over HTTPS (DoH) to pkarr servers.\nCaching and Scalability\nClients and pkarr servers cache records extensively to minimize DHT traffic and improve scalability. The DHT drops records after a few hours, so it’s important to republish records periodically.\nNext Steps\nFor more technical details on pkarr’s architecture and how it works, refer to the architecture note."},"Pubky-Core/Pkarr/3.Expectations":{"title":"3.Expectations","links":["Pubky-Core/Pkarr/0.Introduction","Technologies/DHT","Pubky-Core/Pkarr/1.Why-Pkarr"],"tags":[],"content":"Understanding the expectations and limitations of pkarr is crucial for effective use. This note outlines what pkarr is not and what users should expect.\nNot a Storage Platform\npkarr is not a storage platform. Records are ephemeral and need to be refreshed regularly to remain on the DHT.\nNot a Real-time Communication Medium\npkarr is not designed for real-time communication. It is optimized for infrequent updates and heavy caching to reduce traffic.\nRate Limiting and Proof of Work\nExpectations include enforcing harsh rate-limiting and possibly demanding proof of work for updates.\nCaching and Propagation Time\nRecords are heavily cached, and updates might take some time to propagate. In case of a cache miss, querying the DHT might take a few seconds.\nNext Steps\nFor a deeper understanding of why pkarr was created and its motivation, refer to the why pkarr? note."},"Pubky-Core/Pkarr/4.Architecture":{"title":"4.Architecture","links":["Pubky-Core/Pkarr/0.Introduction","Technologies/DNS","Technologies/Mainline-DHT","Technologies/HTTPS","Technologies/DoH"],"tags":[],"content":"In-depth look at the architecture of pkarr, including its components and how they interact.\nComponents\n\nClient: Applications or users that publish or query resource records.\nRelay: Optional intermediary that helps clients behind NAT or firewall to communicate with the DNS.\nDNS: The overlay network used for storing and retrieving resource records.\nRepublisher: Services that keep resource records alive on the DNS by periodically republishing them.\n\nInteraction Flow\n\nPublishing: Clients publish resource records to the DNS through a relay.\nRepublishing: Clients can request republishing of their records to ensure they remain available on the DNS.\nQuerying: Clients query the DNS for resource records, either directly or through a relay.\n\nKey Technologies\n\nMainline DHT: Pkarr uses the Mainline DNS as its overlay network, specifically BEP44 for storing ephemeral data.\nDNS over HTTPS (DoH): For applications unaware of Pkarr, DoH is used to resolve domains.\n"},"Pubky-Core/Pkarr/ELI5":{"title":"ELI5","links":[],"tags":[],"content":"ELI5: PKARR with Mainline DHT\nImagine you have a super cool secret club, and everyone in the club needs a way to find each other and communicate without relying on anyone else to organize things. You all have secret codes that tell people who you are, but how do you find where everyone is without a central place telling you?\nThis is where PKARR and Mainline DHT come in.\nPKARR is like a magic address book. Instead of having a central directory, every member of the secret club can create their own identity using special keys, like giving yourself a secret nickname that no one else can copy. With these keys, everyone in the club knows exactly who you are, and they can recognize you by your secret name. But there’s no single person in charge of this address book—everyone has their own copy.\nNow, imagine you want to send messages to your friends, but you don’t know where they’re hanging out today. This is where Mainline DHT (Distributed Hash Table) comes in. It’s like a giant treasure map that the whole club shares, except instead of finding treasure, it tells you where each of your friends are. Mainline DHT helps everyone find each other without needing a central leader. It’s like everyone working together to keep the map up-to-date so anyone can see where everyone else is, no matter where they are.\n\n\nYour Own Key-Based Identity: PKARR lets you create your own unique identity without needing permission. You can join the network by making your own keys, and these keys make sure that no one can pretend to be you.\n\n\nFinding Friends with DHT: Mainline DHT is how you find other people in the network. It’s like a shared phone book where everyone adds their own contact info, so anyone can look up where to find you.\n\n\nTogether, PKARR and Mainline DHT mean that everyone in the club can find each other and communicate directly, without relying on any big organization to manage things. It’s all about keeping control in the hands of the people, making sure everyone can be found when they want to be, and keeping everything open and secure."},"Pubky-Core/notes/1.Adoption":{"title":"1.Adoption","links":["2.Censorship"],"tags":[],"content":"Pubky Adoption\nThis note is indicative and creative. There is no set on stone plans for realizing adoption, these are just ideas. Realizing the full potential of Pubky relies on network effects through mainstream user onboarding:\n\n\nLegacy centralized imports ease migration paths for established communities and profiles.\n\n\nSimplified wallet and key management avoids barriers through friendly UX.\n\n\nDefault public profiles paired with granular privacy, encourage open participation.\n\n\nProgressive web apps (PWA) maintain familiar experience across any device.\n\n\nIncentivized discovery games spark initial engagements like following interesting accounts.\n\n\nFederation with aligned systems like Mastodon expands the userbase through existing clusters.\n\n\nGrassroots developers support localized languages/cultures for global inclusion.\n\n\nDocumentation, scholarships and bounties lower the skill floor for contributing back to protocols.\n\n\nOverall, Pubky relies on being ready and available at the right time and right place. Most likely users will only discover Pubky during a Censorship attack."},"Pubky-Core/notes/2.Incentives":{"title":"2.Incentives","links":[],"tags":[],"content":"Pubky Incentives\nThis note is indicative and creative. Nothing is planned concretely for Pubky incentives. For the Pubky ecosystem to function at scale, it relies on incentives that encourage participation and uphold the user experience:\n\n\nData storage fees pay stores for availability and throughput.\n\n\nTipping and subscriptions reward high-quality contributors and curators.\n\n\nAdvertising supports free-tier services and indexes through contextual/non-intrusive formats.\n\n\nValidation bonds and slashing conditions secure protocol compliance.\n\n\nData marketplace sales enable professional content creators to profit directly.\n\n\nJob boards and service directories create opportunities within the emerging peer-to-peer economy.\n\n\nTogether, these push the system towards collective benefit over individual maximization."},"Pubky-Core/notes/3.Protocols":{"title":"3.Protocols","links":["Technologies/Paykit"],"tags":[],"content":"Pubky Protocols\nThis note is indicative and highly creative. We have not yet explored much about the open protocols that enable independent implementations:\nPubky Data - Definition of normalized data schemas for user profiles, content types, relationships etc. Allows unified querying across services.\nPubky Sync - Mechanism for efficiently synchronizing incremental changes between data stores, aggregators, and consumers using Merkle trees.\nPubky Search - Format for full-text search indices and queries across aggregated Pubky Data. Enables cross-platform discovery.\nPubky Payments - Decentralized and interoperable payment protocol for microtransactions like tips, subscriptions and purchasing goods/services.\nPubky Identity - Self-sovereign digital credentials for authentication without centralized authorities like usernames/passwords.\nPubky Federation - Standard for distributed moderation and cross-instance relationships between interconnected but independent communities."},"TLDR":{"title":"TLDR","links":["Pubky-App/Introduction"],"tags":[],"content":"Pubky App - TLDR\nPubky App is an open-source web application that helps users publish and consume Pubky homeserver data within a user experience that merges the features of popular social media, search, and publishing apps.\nArchitecture overview.\n"},"Technologies/DHT":{"title":"DHT","links":["Technologies/Mainline-DHT","Concepts/Censorship"],"tags":[],"content":"Distributed Hash Table - DHT\nIt is a decentralized key-value store that allows for efficient data retrieval in a distributed system. Unlike traditional databases, DHTs do not rely on a central server to manage data. Instead, they use a hash function to map keys to nodes in the network, enabling data to be stored and retrieved across multiple nodes.\nA relevant example of DHT for Pubky is the Mainline DHT that is used primarily by the BitTorrent Network.\nKey Features\n\n\nDecentralization: DHTs operate without a central authority, making them highly resilient to failures and censorship.\n\n\nScalability: They can easily scale to accommodate more data and users by adding more nodes to the network.\n\n\nEfficiency: By distributing data across multiple nodes, DHTs can provide fast access to data without the need for a central server.\n\n\nApplications\nDHTs are widely used in various applications, including:\n\n\nP2P Networks: They are the backbone of peer-to-peer (P2P) networks, enabling the sharing of files and resources among users.\n\n\nContent Delivery Networks (CDNs): DHTs help in efficiently distributing content across a global network of servers, improving load balancing and reducing latency.\n\n\nChallenges\nDespite their advantages, DHTs face several challenges, including:\n\n\nSecurity: Ensuring data privacy and integrity in a decentralized environment.\n\n\nConsistency: Achieving consistency across the distributed network, especially in the presence of node failures or network partitions.\n\n\nPerformance: Balancing the trade-off between data distribution and access latency.\n\n\nDHTs represent a significant advancement in distributed systems, offering a scalable and efficient solution for data storage and retrieval in decentralized environments."},"Technologies/DNS":{"title":"DNS","links":[],"tags":[],"content":"Domain Name System - DNS\nIt translates human-readable domain names (e.g., www.example.com) into IP addresses that computers use to identify each other on the network. This process simplifies internet navigation by allowing users to access websites using memorable names instead of numerical addresses."},"Technologies/DoH":{"title":"DoH","links":["Technologies/DNS","Pubky-Core/Pkarr/0.Introduction","Technologies/HTTPS"],"tags":[],"content":"DNS over HTTPS - DoH\nIt is a security protocol that encrypts DNS queries and responses, enhancing privacy and security by preventing eavesdropping and tampering. In the context of pkarr, DoH plays a crucial role in ensuring that DNS queries made to resolve public-key addresses are secure and cannot be intercepted or manipulated by third parties.\nKey Points about DoH\n\n\nEncryption: DoH encrypts DNS traffic, making it unreadable to anyone who might intercept the data. This is achieved by sending DNS queries and responses over HTTPS connections, utilizing port 443, the standard port for HTTPS traffic.\n\n\nPrivacy and Security: By encrypting DNS queries, DoH significantly increases privacy and security. It prevents Internet Service Providers (ISPs), governments, and hackers from monitoring or altering DNS requests.\n\n\nStandardization and Adoption: DoH has been adopted by major internet brands, including Apple, Microsoft, and Google, to enhance online security. It was first implemented by Mozilla in 2018, and since then, it has become a standard for secure DNS communication.\n\n\nCompatibility and Implementation: DoH can be enabled in browsers and operating systems, allowing users to benefit from its privacy and security features. However, it’s important to ensure compatibility with existing cybersecurity solutions, as enabling DoH might impact DNS traffic filtering tools.\n\n"},"Technologies/HTTPS":{"title":"HTTPS","links":["Technologies/DNS"],"tags":[],"content":"Hypertext Transfer Protocol Secure - HTTPS\nIt is an extension of HTTP that encrypts communication over a computer network, enhancing security and privacy. It uses TLS (Transport Layer Security) or SSL (Secure Sockets Layer) for encryption, protecting against eavesdropping and tampering. HTTPS is essential for securely transmitting sensitive data, such as login credentials and financial transactions, ensuring the authenticity of websites and the privacy of user communications.\nKey Features\n\n\nEncryption: Secures data in transit using TLS/SSL, making it unreadable to interceptors.\n\n\nAuthentication: Verifies the identity of websites and services using digital certificates, ensuring users are communicating with the intended party.\n\n\nProtection: Guards against man-in-the-middle attacks and DNS spoofing, safeguarding user data and privacy.\n\n"},"Technologies/Key-Pair":{"title":"Key Pair","links":[],"tags":[],"content":"A cryptography key pair consists of two related but distinct cryptographic keys:\n\nPrivate Key: A secret key that is used to decrypt, sign, or authenticate data. It’s called “private” because it should be kept confidential and secure to prevent unauthorized access.\nPublic Key: A publicly accessible key that is used to encrypt, verify, or authenticate data. It’s called “public” because it can be shared freely without compromising the security of the system.\n\nHow do key pairs work?\nHere’s a simplified overview of how key pairs are used in various cryptographic scenarios:\nEncryption\n\nAlice wants to send a secure message to Bob.\nBob generates a key pair and shares his public key with Alice.\nAlice uses Bob’s public key to encrypt the message.\nBob uses his private key to decrypt the message.\n\nDigital Signatures\n\nAlice wants to send a document to Bob and prove its authenticity.\nAlice generates a key pair and uses her private key to sign the document.\nBob uses Alice’s public key to verify the signature and ensure the document hasn’t been tampered with.\n\nAuthentication\n\nAlice wants to access a secure system or service.\nThe system generates a key pair and shares its public key with Alice.\nAlice uses the system’s public key to encrypt a challenge or password.\nThe system uses its private key to decrypt the challenge or password and authenticate Alice.\n\nKey Pair Properties\n\nAsymmetric: Key pairs are asymmetric, meaning that the private key is not easily derived from the public key.\nMathematical relationship: The private and public keys are mathematically related, allowing for encryption, decryption, signing, and verification.\nUnique: Each key pair is unique, ensuring that data encrypted with a public key can only be decrypted with the corresponding private key.\n\nTypes of Key Pairs\n\nRSA (Rivest-Shamir-Adleman): A popular algorithm used for encryption, decryption, and digital signatures.\nElliptic Curve Cryptography (ECC): A more modern algorithm used for encryption, decryption, and digital signatures, offering better security with smaller key sizes.\nDiffie-Hellman (DH): A key exchange algorithm used to establish a shared secret key between two parties.\n\nIn summary, cryptography key pairs are a fundamental component of secure online communications, enabling encryption, digital signatures, and authentication. By using a pair of related but distinct keys, key pairs provide a secure way to protect data and ensure its authenticity."},"Technologies/Mainline-DHT":{"title":"Mainline DHT","links":["Technologies/DHT","Concepts/Censorship"],"tags":[],"content":"Mainline DHT is a standard Distributed Hash Table (DHT) implementation widely used in the BitTorrent network, based on the Kademlia protocol. This decentralized system allows for efficient data storage and retrieval across a vast network of nodes, making it highly resilient and scalable.\nKey Features\n\nDecentralization: It operates without a central authority, enhancing its resilience against failures and censorship.\nScalability: It can easily scale to accommodate more data and users by adding more nodes to the network.\nEfficiency: By distributing data across multiple nodes, Mainline DHT provides fast access to data without the need for a central server.\n\nApplications\n\nBitTorrent Network: Mainline DHT adds tracker capabilities to each peer in the BitTorrent network, enhancing its resilience and reducing dependency on centralized trackers.\nPeer-to-Peer File Sharing: Beyond BitTorrent, DHTs like Mainline are used for instant messaging, name resolution, and other peer-to-peer file sharing applications.\n"},"Technologies/Paykit":{"title":"Paykit","links":["Data-Stores"],"tags":[],"content":"Paykit abstracts and automates any payment method behind a single, static public key. The public key belongs to a Pubky instance and points to a data store containing all supported payment endpoints. Paykit enables applications where users pay directly to profiles, so offers a very intuitive experience, particularly when multiple payment methods are possible within the system."},"index":{"title":"index","links":["Pubky-Core/Introduction","Pubky-Core/Pkarr/Introduction","Pubky-App/Introduction","Pubky-Core/Homeservers","Concepts/Censorship","Concepts/Credible-Exit","Concepts/Semantic-Social-Graph","Vision"],"tags":[],"content":"Welcome to the Pubky Knowledge Base\nThis is a knowledge base for the Pubky platform, which includes Pubky Core, PKARR and Pubky App. These documents are a work in progress, much like Pubky’s protocols and applications!\nWhat is Pubky?\nPubky attempts to unlock the web by realizing our vision for a key-based, self-regulating web that puts users in control.\nSo far, Pubky does this by combining practical decentralized routing &amp; identity (PKARR), with simple interoperable hosting (Homeservers) that allow for censorship resistance and a credible exit, as well as a publishing application, Pubky App, that facilitates the creation of a Semantic Social Graph, which can be used for filtering, discovery, matching and coordination.\nLearn more about the overall vision here: The Vision of Pubky\nGet Started\n\nGetting Started with PKARR - If your main interest is using the most decentralized, key-based identity &amp; routing method, start with PKARR.\nPubky Core - Introduction - If you want run your own Homeserver and apply PKARR, check out Pubky Core.\nPubky App - Introduction - If you want to dig into the application, indexer, etc, start here!\n"},"readme":{"title":"readme","links":[],"tags":[],"content":":brain: Pubky Knowledge Base\nWelcome to the Pubky Knowledge base - we are excited to have you here.\n🔗 Access the Pubky Knowledge Base: notes.pubky,app!\n\nThe current Knowledge base is a mix of reality, dreams, visions, actuality and plans.\n\nThe Knowledge Base is a resource that encompasses our broad vision for Pubky, along with high-level explanations of the architecture for both the Pubky Protocol and the Pubky App, as well as key concepts. Use this as your go-to guide to help you navigate unfamiliar topics and find answers to the most common questions.\n📝 Contributing Knowledge\nWe kindly ask you to help us improve this documentation for a clearer, more accurate and concise knowledge base. Simply open a PR!\n🏗️ Build static Quartz site\nIn order to build the static website from this obsidian vault, ensure that NodeJS is installed on your system.\n\nEnter in the terminal to the project root and access to the /quartz directory (cd quartz)\nInstall dependencies with npm install\nFinally build the site with npm run docs and check it out at localhost:8080\n"},"vision":{"title":"vision","links":[],"tags":[],"content":"The Vision of Pubky: Decentralizing Our Future\nImagine a future where our online relationships are no longer dictated by corporate giants or state-controlled systems, where you decide how to connect, who to trust, and where to store your data. This is the vision of Pubky: a decentralized, user-first web that breaks the toxic cycle of dependency on Big Tech, Big State, and Big Banks.\nPubky is not just a platform—it is an ecosystem designed to provide tools for communication, social coordination, identity management, and, eventually, financial freedom, all in one interconnected framework. Pubky will harness the power of decentralized identity, censorship resistance, semantic social graphs, and Bitcoin and Lightning Network technology to create an open web that prioritizes user autonomy.\nReplacing Big Tech: Credible Exit, Censorship Resistance, and User-Controlled Experience\nBig Tech platforms like social media giants use algorithms that limit freedom, exploit engagement, and control the flow of information. Pubky proposes a different kind of web—one built on Semantic Social Graphs and self-sovereign identities. Instead of opaque algorithms deciding what is relevant to you, Semantic Social Graphs and PKARR give users full control over their digital interactions. This system gives control back to individuals, helping replace our toxic relationship with Big Tech.\n\n\nPKARR for Credible Exit and Censorship Resistance: With PKARR, users can create decentralized identities that allow them to leave any service without losing their content, identity, or relationships. PKARR also makes censorship resistance possible by ensuring that users’ identities are independent of any specific server. This means users can migrate to other services when needed, maintaining their control and avoiding censorship.\n\n\nSemantic Social Graphs for Personalized Control: Semantic Social Graphs empower users by allowing them to enrich their relationships, determine trustworthiness, and organize content in a meaningful way. Users choose what they see, whom they trust, and how information flows within their network.\n\n\nPubky App for User-Controlled Feeds: The Pubky App allows users to decide which data appears in their feeds. Unlike traditional platforms where algorithms push content for maximum engagement, Pubky gives users the power to tag, filter, and prioritize the content that matters most to them. This approach replaces toxic algorithms with user-defined preferences, ensuring a healthier online experience.\n\n\nHomeservers for Decentralized Hosting: Homeservers allow for decentralized data hosting and competitive hosting services by enabling users to migrate away from any server that changes its policies or restricts their content. This means that censorship is anticipated and dealt with, allowing users to keep control over their digital presence.\n\n\nReplacing Big State: Self-Sovereign Identity and Peer Regulation\nGovernments often use centralized systems to control speech, monitor user activity, and dictate identity management. Pubky provides an alternative—a decentralized network that makes censorship impractical and gives users self-sovereign identity. With Pubky, PKARR (Public Key Addressable Roles and Resources), Mainline DHT, and Semantic Social Graphs ensure that users are empowered to self-regulate, verify authenticity, and maintain control of their identities without relying on centralized authorities. This means:\n\n\nSelf-Sovereign Identity with PKARR: Pubky allows users to create key-based identities using PKARR, giving them the freedom to establish and manage their identities without permission from any central entity. Users can choose whether to remain anonymous or become publicly identifiable, and no central authority can revoke or control their identity.\n\n\nDecentralized Directory with Mainline DHT: Mainline DHT acts as a distributed directory, helping users locate and connect with each other without relying on a centralized server. This peer-to-peer system ensures that users are always discoverable by those they trust, even in the face of censorship attempts.\n\n\nSemantic Social Graphs for Peer Regulation: Pubky’s Semantic Social Graphs are key to creating an environment of self-regulation among users. By allowing users to add context, trust levels, and tags to their connections, Pubky provides the foundation for automating business logic on top of graph metadata and relationships. This means that users can set the rules for how they interact with others, creating systems of accountability and shared trust that do not depend on external regulation.\n\n\nIn this way, Pubky replaces the need for a centralized authority (the “Big State”) by empowering users to be self-sovereign and enabling communities to regulate themselves. Pubky provides the tools to make censorship difficult and autonomy possible—giving users the power to govern their online interactions and identities independently.\nReplacing Big Banks: Competing with Fiat and Enabling Financial Freedom\nBeyond communication and social interaction, Synonym also seeks to empower individuals financially. Our reliance on Big Banks and centralized financial systems means losing autonomy over our own wealth. Pubky envisions a future where financial freedom is possible through the use of  Bitcoin and the Lightning Network to decouple payments from hosted platforms and middlemen.\n\n\nBitcoin creates competition for fiat currencies and traditional speculative investments by offering a decentralized, permissionless currency. Users are in full control of their funds, able to send or receive value directly from their own wallets, free from the constraints of centralized banking institutions.\n\n\nBitkit Mobile Wallet: Synonym, creators of Pubky, also offers the Bitkit mobile wallet, which supports Bitcoin, Lightning, and soon Pubky features, providing a unified solution for users to manage their identities, financial transactions, and online presence—all in a decentralized manner.\n\n\nCommerce features and tools are planned for future versions of Pubky, with a long term goal of a totally dynamic digital social economy!\n\n\nA Future of Freedom and Autonomy\nOur vision is simple: to build a digital world where individuals are in charge, rather than corporations or governments. By integrating decentralized identities, censorship-resistant technologies, and financial independence, we can replace our toxic dependency on centralized powers with an open, user-controlled web.\nImagine a future where your data, your identity, and your financial assets are truly yours. Where you decide what to share, whom to trust, and how to connect—without any company or government watching over your shoulder. Synonym is building this future, creating an internet that works for people, not against them.\nJoin us in this movement toward decentralization, censorship resistance, and true digital autonomy."}}